In [1]:
import csv
import pandas as pd

In [2]:
df=pd.read_csv('Resources/climate_df.csv')

In [3]:
df.head()

,Unnamed: 0,EVENT_ID,STATE,YEAR,MONTH_NAME,EVENT_TYPE,FLOOD_CAUSE,CATEGORY,EVENT_NARRATIVE
0,0,254780,NEW HAMPSHIRE,2010,July,Heat,NaN,NaN,Heat index values at the Nashua Boire Field (K...
1,1,211550,NEW HAMPSHIRE,2010,January,Heavy Snow,NaN,NaN,Four to eight inches fell across eastern Hills...
2,2,260014,NEW HAMPSHIRE,2010,October,Strong Wind,NaN,NaN,"In Manchester, firefighters responded to about..."
3,3,254779,NEW HAMPSHIRE,2010,July,Heat,NaN,NaN,Heat index values at the Manchester Airport (K...
4,4,273769,NEW HAMPSHIRE,2010,December,Winter Storm,NaN,NaN,Snowfall totals of 6 to 10 inches were observe...

In [4]:
#drop two additional rows and unnamed as they have nothing to do with our question
df = df.drop(['Unnamed: 0', 'FLOOD_CAUSE', 'CATEGORY'], axis=1)
df.head()

,EVENT_ID,STATE,YEAR,MONTH_NAME,EVENT_TYPE,EVENT_NARRATIVE
0,254780,NEW HAMPSHIRE,2010,July,Heat,Heat index values at the Nashua Boire Field (K...
1,211550,NEW HAMPSHIRE,2010,January,Heavy Snow,Four to eight inches fell across eastern Hills...
2,260014,NEW HAMPSHIRE,2010,October,Strong Wind,"In Manchester, firefighters responded to about..."
3,254779,NEW HAMPSHIRE,2010,July,Heat,Heat index values at the Manchester Airport (K...
4,273769,NEW HAMPSHIRE,2010,December,Winter Storm,Snowfall totals of 6 to 10 inches were observe...

In [5]:
#check for null values
df.isnull().sum()

EVENT_ID                0
STATE                   0
YEAR                    0
MONTH_NAME              0
EVENT_TYPE              0
EVENT_NARRATIVE    182826
dtype: int64

In [6]:
#fill event_narrative null values with "no event description"
df['EVENT_NARRATIVE'] =  df['EVENT_NARRATIVE'].fillna('No event description')
df.isnull().sum()

EVENT_ID           0
STATE              0
YEAR               0
MONTH_NAME         0
EVENT_TYPE         0
EVENT_NARRATIVE    0
dtype: int64

In [7]:
#create a new copy of cleaned data for later use
df.to_csv('Resources/cleaneddata.csv')

In [9]:
#slice first 1000 entries for sample data for model
sliced = df.iloc[0:999]
sliced.head()

,EVENT_ID,STATE,YEAR,MONTH_NAME,EVENT_TYPE,EVENT_NARRATIVE
0,254780,NEW HAMPSHIRE,2010,July,Heat,Heat index values at the Nashua Boire Field (K...
1,211550,NEW HAMPSHIRE,2010,January,Heavy Snow,Four to eight inches fell across eastern Hills...
2,260014,NEW HAMPSHIRE,2010,October,Strong Wind,"In Manchester, firefighters responded to about..."
3,254779,NEW HAMPSHIRE,2010,July,Heat,Heat index values at the Manchester Airport (K...
4,273769,NEW HAMPSHIRE,2010,December,Winter Storm,Snowfall totals of 6 to 10 inches were observe...

In [10]:
#create a csv copy of the sliced df for sample data
sliced.to_csv('Resources/sampledata.csv')